In [1]:
from io import StringIO

In [2]:
import pandas as pd

In [28]:
df=pd.read_csv('/Users/binoddhami/Desktop/XLS FILES/Financials Sample Data.csv')
df.head()

,Account,Businees Unit,Currency,Year,Scenario,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Sales,Software,USD,2012,Actuals,"$90,924,002","$82,606,134","$72,780,220","$52,943,701","$77,528,109","$96,384,524","$77,345,061","$98,290,873","$79,879,127","$95,373,403","$54,887,908","$82,703,597"
1,Cost of Goods Sold,Software,USD,2012,Actuals,"($41,623,278)","($40,464,347)","($30,806,326)","($21,412,962)","($37,047,252)","($44,819,597)","($34,847,393)","($47,903,350)","($35,880,653)","($44,982,115)","($26,929,424)","($34,233,473)"
2,Commissions Expense,Software,USD,2012,Actuals,"($4,454,359)","($3,386,032)","($3,389,705)","($2,149,257)","($3,168,079)","($4,417,624)","($3,386,461)","($4,052,846)","($3,418,737)","($4,365,527)","($2,455,561)","($3,646,726)"
3,Payroll Expense,Software,USD,2012,Actuals,"($9,901,680)","($9,871,172)","($8,459,696)","($6,303,408)","($8,493,573)","($11,082,494)","($8,081,033)","($11,070,018)","($8,410,665)","($10,081,727)","($6,300,578)","($9,099,438)"
4,Travel & Entertainment Expense,Software,USD,2012,Actuals,"($951,255)","($838,985)","($872,700)","($624,416)","($919,835)","($1,085,296)","($818,602)","($1,040,585)","($803,190)","($1,158,623)","($611,335)","($941,542)"

In [13]:
type(df)

pandas.core.frame.DataFrame

In [15]:
data=('col1,col2,col3\n'
    'x,y,1\n'
    'a,b,2\n'
    'c,d,3')

In [16]:
type(data)

str

In [17]:
#in memory file formate object
StringIO(data)

In [18]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [23]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [29]:
df=pd.read_csv('/Users/binoddhami/Desktop/XLS FILES/Financials Sample Data.csv',usecols=['Jan','Feb','Mar','Apr','May','Jun'])
df.head()

,Jan,Feb,Mar,Apr,May,Jun
0,"$90,924,002","$82,606,134","$72,780,220","$52,943,701","$77,528,109","$96,384,524"
1,"($41,623,278)","($40,464,347)","($30,806,326)","($21,412,962)","($37,047,252)","($44,819,597)"
2,"($4,454,359)","($3,386,032)","($3,389,705)","($2,149,257)","($3,168,079)","($4,417,624)"
3,"($9,901,680)","($9,871,172)","($8,459,696)","($6,303,408)","($8,493,573)","($11,082,494)"
4,"($951,255)","($838,985)","($872,700)","($624,416)","($919,835)","($1,085,296)"

In [34]:
df.to_csv('text.csv',index=False)

In [36]:
##datatype in csv
data=('a,b,c,d\n'
     '1,2,3,4\n'
    '9,10,11')

In [37]:
df=pd.read_csv(StringIO(data))

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      float64
 1   b       2 non-null      float64
 2   c       2 non-null      float64
 3   d       1 non-null      float64
dtypes: float64(4)
memory usage: 192.0 bytes

In [52]:
#changing the datatype
df=pd.read_csv(StringIO(data),dtype='object')

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      object
 1   b       2 non-null      object
 2   c       2 non-null      object
 3   d       1 non-null      object
dtypes: object(4)
memory usage: 192.0+ bytes

In [54]:
df.head()

   a   b   c    d
0  1   2   3    4
1  9  10  11  NaN

In [43]:
df=pd.read_csv(StringIO(data),dtype='float')

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      float64
 1   b       2 non-null      float64
 2   c       2 non-null      float64
 3   d       1 non-null      float64
dtypes: float64(4)
memory usage: 192.0 bytes

In [45]:
df.head()

     a     b     c    d
0  1.0   2.0   3.0  4.0
1  9.0  10.0  11.0  NaN

In [50]:
df.head()

     a     b     c    d
0  1.0   2.0   3.0  4.0
1  9.0  10.0  11.0  NaN

In [55]:
df.head()

   a   b   c    d
0  1   2   3    4
1  9  10  11  NaN

In [56]:
#to check null values
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [57]:
df['a']

0    1
1    9
Name: a, dtype: object

In [64]:
##datatype in csv
data=('a,b,c,d\n'
     '1,2,3,4\n'
    '9,10,11')

In [67]:
#changing datatype
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [68]:
df.head()

   a     b   c    d
0  1   2.0   3  4.0
1  9  10.0  11  NaN

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      float64
 2   c       2 non-null      int64
 3   d       1 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 192.0 bytes

In [70]:
df.dtypes

a      int64
b    float64
c      int64
d    float64
dtype: object

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      float64
 2   c       2 non-null      int64
 3   d       1 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 192.0 bytes